Moon-zh/STM32-Project/集中控制产品/集中控制产品/多通道水肥一体机/CtrlBoard/STM32F103RCT6/HARDWARE/RS485/rs485.c
		/* 改写FIFO读索引 */
		DISABLE_INT();
		if (++_pUart->usRxRead >= _pUart->usRxBufSize)
		{
			_pUart->usRxRead = 0;
		}
		_pUart->usRxCount--;
		ENABLE_INT();
		return 1;
	}
}

/*
*********************************************************************************************************
*	函 数 名: UartIRQ
*	功能说明: 供中断服务程序调用，通用串口中断处理函数
*	形    参: _pUart : 串口设备
*	返 回 值: 无
*********************************************************************************************************
*/
static void UartIRQ(UART_T *_pUart)
{	
	
	/* 处理接收中断  */

	if (USART_GetITStatus(_pUart->uart, USART_IT_RXNE) != RESET)
	{
		/* 从串口接收数据寄存器读取数据存放到接收FIFO */
		uint8_t ch;

		ch = USART_ReceiveData(_pUart->uart);
		_pUart->pRxBuf[_pUart->usRxWrite] = ch;
		if (++_pUart->usRxWrite >= _pUart->usRxBufSize)
		{
			_pUart->usRxWrite = 0;
		}
		if (_pUart->usRxCount < _pUart->usRxBufSize)
		{
			_pUart->usRxCount++;
		}

//		if(_pUart->uart == UART5) queue_push(ch);
		/* 回调函数,通知应用程序收到新数据,一般是发送1个消息或者设置一个标记 */
		//if (_pUart->usRxWrite == _pUart->usRxRead)
		//if (_pUart->usRxCount == 1)
		{
			if (_pUart->ReciveNew)
			{
				_pUart->ReciveNew(ch);
			}
		}
	}

	/* 处理发送缓冲区空中断 */
	if (USART_GetITStatus(_pUart->uart, USART_IT_TXE) != RESET)
	{
		//if (_pUart->usTxRead == _pUart->usTxWrite)
		if (_pUart->usTxCount == 0)
		{
			/* 发送缓冲区的数据已取完时， 禁止发送缓冲区空中断 （注意：此时最后1个数据还未真正发送完毕）*/
			USART_ITConfig(_pUart->uart, USART_IT_TXE, DISABLE);

			/* 使能数据发送完毕中断 */
			USART_ITConfig(_pUart->uart, USART_IT_TC, ENABLE);
		}
		else
		{
			/* 从发送FIFO取1个字节写入串口发送数据寄存器 */
			USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
			if (++_pUart->usTxRead >= _pUart->usTxBufSize)
			{
				_pUart->usTxRead = 0;
			}
			_pUart->usTxCount--;
		}

	}
	/* 数据bit位全部发送完毕的中断 */
	else if (USART_GetITStatus(_pUart->uart, USART_IT_TC) != RESET)
	{
		//if (_pUart->usTxRead == _pUart->usTxWrite)
		if (_pUart->usTxCount == 0)
		{
			/* 如果发送FIFO的数据全部发送完毕，禁止数据发送完毕中断 */
			USART_ITConfig(_pUart->uart, USART_IT_TC, DISABLE);
//			_pUart->usTxWrite = 0;
			/* 回调函数, 一般用来处理RS485通信，将RS485芯片设置为接收模式，避免抢占总线 */
			if (_pUart->SendOver)
			{
//				_pUart->usTxWrite = 0;
				_pUart->SendOver();
			}
		}
		else
		{
			/* 正常情况下，不会进入此分支 */

			/* 如果发送FIFO的数据还未完毕，则从发送FIFO取1个数据写入发送数据寄存器 */
			USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
			if (++_pUart->usTxRead >= _pUart->usTxBufSize)
			{
				_pUart->usTxRead = 0;
			}
			_pUart->usTxCount--;
		}
	}
}

/*
*********************************************************************************************************
*	函 数 名: USART1_IRQHandler  USART2_IRQHandler USART3_IRQHandler UART4_IRQHandler UART5_IRQHandler
*	功能说明: USART中断服务程序
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#if UART1_FIFO_EN == 1
void USART1_IRQHandler(void)
{
	#if uCOS_EN == 1
    OS_CPU_SR cpu_sr=0;
    OS_ENTER_CRITICAL();
       OSIntEnter();                         
	OS_EXIT_CRITICAL();
	#endif
	
	UartIRQ(&g_tUart1);
	
	#if uCOS_EN == 1
		OSIntExit();                           
	#endif	
}
#endif

#if UART2_FIFO_EN == 1
void USART2_IRQHandler(void)
{
	#if uCOS_EN == 1
		OS_CPU_SR cpu_sr=0;
	
		OS_ENTER_CRITICAL();
		OSIntEnter();						  
		OS_EXIT_CRITICAL();
	#endif
		
	UartIRQ(&g_tUart2);
	
	#if uCOS_EN == 1
		OSIntExit();						   
	#endif
} 
#endif

#if UART3_FIFO_EN == 1
void USART3_IRQHandler(void)
{
	#if uCOS_EN == 1
    OS_CPU_SR cpu_sr=0;

	    OS_ENTER_CRITICAL();
        OSIntEnter();                         
		OS_EXIT_CRITICAL();
	#endif
	
	UartIRQ(&g_tUart3);

	#if uCOS_EN == 1
		OSIntExit();                           
	#endif
}
#endif

#if UART4_FIFO_EN == 1
void UART4_IRQHandler(void)
{
	#if uCOS_EN == 1
    OS_CPU_SR cpu_sr=0;

	    OS_ENTER_CRITICAL();
        OSIntEnter();                         
		OS_EXIT_CRITICAL();
	#endif
	
	UartIRQ(&g_tUart4);
	
	#if uCOS_EN == 1
		OSIntExit();                           
	#endif
}
#endif

#if UART5_FIFO_EN == 1
void UART5_IRQHandler(void)
{
	#if uCOS_EN == 1
    OS_CPU_SR cpu_sr=0;

	    OS_ENTER_CRITICAL();
        OSIntEnter();                         
		OS_EXIT_CRITICAL();
	#endif
	
	UartIRQ(&g_tUart5);
	
	#if uCOS_EN == 1
		OSIntExit();                           
	#endif
}
#endif

#if UART6_FIFO_EN == 1
void USART6_IRQHandler(void)
{
	#if uCOS_EN == 1
    OS_CPU_SR cpu_sr=0;

	    CPU_CRITICAL_ENTER();
        OSIntEnter();                         
		CPU_CRITICAL_EXIT();
	#endif
	
	UartIRQ(&g_tUart6);
	
	#if uCOS_EN == 1
		OSIntExit();                           
	#endif
}
#endif

/*
*********************************************************************************************************
*	函 数 名: fputc
*	功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
////int fputc(int ch, FILE *f)
////{
////#if 0	/* 将需要printf的字符通过串口中断FIFO发送出去，printf函数会立即返回 */
////	comSendChar(COM1, ch);

////	return ch;
////#else	/* 采用阻塞方式发送每个字符,等待数据发送完毕 */
////	/* 写一个字节到USART1 */
////	USART_SendData(USART1, (uint8_t) ch);

////	/* 等待发送结束 */
////	while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
////	{}

////	return ch;
////#endif
////}
uint8_t COM4GetBuf(u8* Buf)
{
	//uint8 Len = 0 ;
	uint8_t WriteP =0;
	uint16_t u16Cnt = 0;
	uint16_t totalCnt = 0;
	UART_T *UARTTemp;
	
	UARTTemp = ComToUart(COM4);
	if(UARTTemp == 0)
	{
		return u16Cnt;
	}
		totalCnt = UARTTemp->usRxCount;

	if(totalCnt > 0)
	{
		delay_ms(15);		
		totalCnt = UARTTemp->usRxCount;//等待数据全部接收完
		for(u16Cnt = 0; u16Cnt < totalCnt; u16Cnt++)
		{
			comGetChar(COM4,&Buf[WriteP++]);
		}
	}
	
	return u16Cnt;
}
//功能:将串口新收到的数据拷贝到指定位置
//输入：端口号，目的地址,buf大小
//输出：0：无新数据 其他：有新数据，且返回数据字节数
uint8_t COMGetBuf(COM_PORT_E _ucPort , Ring* Circle,uint16_t len)
{
	uint16_t u16Cnt = 0;
	uint16_t totalCnt = 0;
	UART_T *UARTTemp;
	UARTTemp = ComToUart(_ucPort);
	if(UARTTemp == 0)
	{
		return u16Cnt;
	}
	totalCnt = UARTTemp->usRxCount;
	if(totalCnt > 0)
	{
		delay_ms(50);		
		totalCnt = UARTTemp->usRxCount;//等待数据全部接收完
		for(u16Cnt = 0; u16Cnt < totalCnt; u16Cnt++)
		{
			comGetChar(_ucPort,&Circle->buf[(Circle->WritePiont++)%len]);
		}
	}
	return u16Cnt;
	
}
//串口1,printf 函数
//确保一次发送数据不超过USART3_MAX_SEND_LEN字节
//u8  USART3_TX_BUF[256]; 			//发送缓冲,最大USART3_MAX_SEND_LEN字节

void u3_printf(char* fmt,...)  
{  
	u16 i,j; 
	va_list ap; 
	va_start(ap,fmt);
	vsprintf((char*)g_TxBuf1,fmt,ap);
	va_end(ap);
	i=strlen((const char*)g_TxBuf1);		//此次发送数据的长度
	for(j=0;j<i;j++)							//循环发送数据
	{
	 	while(USART_GetFlagStatus(USART1,USART_FLAG_TC)==RESET); //循环发送,直到发送完毕   
			USART_SendData(USART1,g_TxBuf1[j]); 
	} 
}
//串口3，发送函数
void usart3send(u8* buf, u16 uLen)
{
	u16 u16Cnt = 0;
	if(buf == NULL || uLen == 0)
	{
		return;
	}
	for(u16Cnt = 0; u16Cnt < uLen ;u16Cnt++)
	{
		while(USART_GetFlagStatus(USART1,USART_FLAG_TC)==RESET); //循环发送,直到发送完毕   
		  USART_SendData(USART1,buf[u16Cnt]); 
	}
}
/*
*********************************************************************************************************
*	函 数 名: fgetc
*	功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int fgetc(FILE *f)
{

#if 1	/* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
	uint8_t ucData;

	while(comGetChar(COM1, &ucData) == 0);

	return ucData;
#else
	/* 等待串口1输入数据 */
	while (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET);

	return (int)USART_ReceiveData(USART1);
#endif
}

/***************************** (END OF FILE) *********************************/



















